src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

src/InformationRegisters/СК_Инвентаризация/СК_Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СК_Инвентаризация</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПересчета</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СК_Ячейки/СК_Ячейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СК_Ячейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/СК_МобСклад/Forms/ФормаИнвентаризацииЯчейки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	ЭтотОбъект.ДокументПересчета = СтруктураПараметров.ДокументПересчета;	
	ЭтотОбъект.Секция = СтруктураПараметров.Секция;
	ЭтотОбъект.Номенклатура = СтруктураПараметров.Номенклатура;
	
	ЗаполнитьФорму();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму()
	
	Количество = 0;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Инвентаризация.Номенклатура КАК Номенклатура,
	               |	СК_Инвентаризация.Ячейка КАК Ячейка,
	               |	СК_Инвентаризация.Количество КАК Количество
	               |ИЗ
	               |	РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	               |ГДЕ
	               |	СК_Инвентаризация.Номенклатура = &Номенклатура
	               |	И СК_Инвентаризация.ДокументПересчета = &ДокументПересчета
	               |	И СК_Инвентаризация.Ячейка.Секция = &Секция"; 
	Запрос.УстановитьПараметр("Номенклатура",ЭтотОбъект.Номенклатура);
	Запрос.УстановитьПараметр("ДокументПересчета",ДокументПересчета.Ссылка);
	Запрос.УстановитьПараметр("Секция",ЭтотОбъект.Секция);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество() >= 1 Тогда
		Элементы.Отсканировано.Заголовок = "Отсканировано: " + Строка(Рез.Итог("Количество")) + " шт"
	Иначе
		Элементы.Отсканировано.Заголовок =  "Отсканировано: 0 шт"
	КонецЕсли;
	
	ЭтотОбъект.НаименованиеНоменклатуры = Номенклатура;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
	АктивироватьПоискЯчейки();

КонецПроцедуры    

&НаКлиенте
Процедура АктивироватьПоискЯчейки() 
	ОчиститьШКСервер(); 
	Элементы.ШКЯчейки.ОбновитьТекстРедактирования();
	Элементы.ШКЯчейки.Видимость = Ложь;
	Элементы.ШКЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКЯчейки; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШКЯчейки = "";
	СканШК = "";
	Количество = 0;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеБуфер(Параметры) Экспорт  
			ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
			АктивироватьПоискЯчейки();
КонецПроцедуры


&НаКлиенте
Процедура ШКЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если Текст = "0000000000001" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Буфер не сканировать!!! ",5,"Ошибка");
		
	Иначе	
		
		Если ШКЯчейкиИзменениеТекстаРедактированияНаСервере(Текст) = Истина Тогда
			АктивироватьПоискСканШК();
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение,"Отсканируйте правильную ячейку ",5,"Ошибка");
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура АктивироватьПоискСканШК() 
	ОчиститьШКСервер(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 


&НаСервере
Функция ШКЯчейкиИзменениеТекстаРедактированияНаСервере(ШК)

	
	ЯчейкаПоиск = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(ШК)).Ссылка;
	
	Если ЯчейкаПоиск.Секция = Секция Тогда 
		ЭтотОбъект.Ячейка = ЯчейкаПоиск;
		Возврат Истина;	
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	//СК = СканШКИзменениеТекстаРедактированияНаСервере(Текст);
	
	Если СканШКИзменениеТекстаРедактированияНаСервере(Текст) = Ложь Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Номенклатура не найдена ",5,"Ошибка");
	Иначе
		ЗаполнитьФорму();
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Процедура АктивироватьКОличество() 
	ОчиститьШКСервер(); 
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 


&НаСервере
Функция СканШКИзменениеТекстаРедактированияНаСервере(Шк)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод",Шк);
 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		ЭтотОбъект.Номенклатура = Рез.Номенклатура.Ссылка;
 		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции

&НаСервере
Процедура ДобавитьНаСервере()
	ЭтотОбъект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	ЭтотОбъект.Ячейка  = Справочники.СК_Ячейки.ПустаяСсылка();
	ЗаполнитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ДобавитьНаСервере(); 
	ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
	АктивироватьПоискЯчейки();
	
КонецПроцедуры

&НаСервере
Процедура КоличествоПриИзмененииНаСервере() 
	
	ТекПользователь = Пользователи.АвторизованныйПользователь().Ссылка; 
	
	НаборЗаписей = РегистрыСведений.СК_Инвентаризация.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.Номенклатура.Установить(ЭтотОбъект.Номенклатура);
	НаборЗаписей.Отбор.Ячейка.Установить(ЭтотОбъект.Ячейка);
	НаборЗаписей.Отбор.Пользователь.Установить(ТекПользователь);
	НаборЗаписей.Отбор.ДокументПересчета.Установить(ДокументПересчета);

	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		НЗапись = НаборЗаписей.Добавить();
		НЗапись.Номенклатура = ЭтотОбъект.Номенклатура;
		НЗапись.Ячейка = ЭтотОбъект.Ячейка;
		НЗапись.Количество = ЭтаФорма.Количество;
		НЗапись.Пользователь = ТекПользователь;
		НЗапись.ДокументПересчета = ЭтотОбъект.ДокументПересчета;
	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
		НЗапись = НаборЗаписей[0];
		НЗапись.Количество = НЗапись.Количество + ЭтаФорма.Количество;
	КонецЕсли;
	НаборЗаписей.Записать();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	КоличествоПриИзмененииНаСервере(); 
	ЗаполнитьФорму();
КонецПроцедуры
